kiffie/pic32-pac/pic32mx2xx/pic32mx2x4fxxxd/PIC32MX274F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ICAP2</name>
      <description>ICAP2 peripheral</description>
      <baseAddress>0xbf802200</baseAddress>
      <registers>
        <register>
          <name>IC2CON</name>
          <description>IC2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CONCLR</name>
          <description>IC2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CONSET</name>
          <description>IC2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CONINV</name>
          <description>IC2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2BUF</name>
          <description>IC2BUF register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC2BUF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
