kiffie/pic32-pac/pic32mx2xx/pic32mx2x4fxxxd/PIC32MX274F256D.svd
        <register>
          <name>PMSTATINV</name>
          <description>PMSTATINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OB0E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OB1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OB2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OB3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OBUF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OBE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IB0F</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IB1F</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IB2F</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IB3F</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IBOV</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IBF</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMWADDR</name>
          <description>PMWADDR register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WADDR</name>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMWADDRCLR</name>
          <description>PMWADDRCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WADDR</name>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMWADDRSET</name>
          <description>PMWADDRSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WADDR</name>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMWADDRINV</name>
          <description>PMWADDRINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WADDR</name>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRADDR</name>
          <description>PMRADDR register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>RADDR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RADDR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRADDRCLR</name>
          <description>PMRADDRCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>RADDR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RADDR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRADDRSET</name>
          <description>PMRADDRSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>RADDR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RADDR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRADDRINV</name>
          <description>PMRADDRINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RADDR</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>RADDR14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RADDR15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRDIN</name>
          <description>PMRDIN register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRDINCLR</name>
          <description>PMRDINCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRDINSET</name>
          <description>PMRDINSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMRDININV</name>
          <description>PMRDININV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RDATAIN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
