kiffie/pic32-pac/pic32mx2xx/pic32mx2x4fxxxd/PIC32MX274F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP2</name>
      <description>CMP2 peripheral</description>
      <baseAddress>0xbf80a010</baseAddress>
      <registers>
        <register>
          <name>CM2CON</name>
          <description>CM2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONCLR</name>
          <description>CM2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONSET</name>
          <description>CM2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONINV</name>
          <description>CM2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP3</name>
      <description>CMP3 peripheral</description>
      <baseAddress>0xbf80a020</baseAddress>
      <registers>
        <register>
          <name>CM3CON</name>
          <description>CM3CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONCLR</name>
          <description>CM3CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONSET</name>
          <description>CM3CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONINV</name>
          <description>CM3CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
