kiffie/pic32-pac/pic32mx2xx/pic32mx2x4fxxxd/PIC32MX274F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCACHE</name>
      <description>PCACHE peripheral</description>
      <baseAddress>0xbf884000</baseAddress>
      <registers>
        <register>
          <name>CHECON</name>
          <description>CHECON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>7</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DCSZ</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CHECOH</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECONCLR</name>
          <description>CHECONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DCSZ</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CHECOH</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECONSET</name>
          <description>CHECONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DCSZ</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CHECOH</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECONINV</name>
          <description>CHECONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DCSZ</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CHECOH</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEACC</name>
          <description>CHEACC register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEIDX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CHEWEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEACCCLR</name>
          <description>CHEACCCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEIDX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CHEWEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEACCSET</name>
          <description>CHEACCSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEIDX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CHEWEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEACCINV</name>
          <description>CHEACCINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEIDX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CHEWEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHETAG</name>
          <description>CHETAG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>2</resetValue>
          <fields>
            <field>
              <name>LTYPE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LLOCK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LVALID</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LTAG</name>
              <bitRange>[23:4]</bitRange>
            </field>
            <field>
              <name>LTAGBOOT</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHETAGCLR</name>
          <description>CHETAGCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LTYPE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LLOCK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LVALID</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LTAG</name>
              <bitRange>[23:4]</bitRange>
            </field>
            <field>
              <name>LTAGBOOT</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHETAGSET</name>
          <description>CHETAGSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LTYPE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LLOCK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LVALID</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LTAG</name>
              <bitRange>[23:4]</bitRange>
            </field>
            <field>
              <name>LTAGBOOT</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHETAGINV</name>
          <description>CHETAGINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LTYPE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LLOCK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LVALID</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LTAG</name>
              <bitRange>[23:4]</bitRange>
            </field>
            <field>
              <name>LTAGBOOT</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEMSK</name>
          <description>CHEMSK register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LMASK</name>
              <bitRange>[15:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEMSKCLR</name>
          <description>CHEMSKCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LMASK</name>
              <bitRange>[15:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEMSKSET</name>
          <description>CHEMSKSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LMASK</name>
              <bitRange>[15:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEMSKINV</name>
          <description>CHEMSKINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LMASK</name>
              <bitRange>[15:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEW0</name>
          <description>CHEW0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEW0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEW1</name>
          <description>CHEW1 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEW1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEW2</name>
          <description>CHEW2 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEW2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEW3</name>
          <description>CHEW3 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEW3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHELRU</name>
          <description>CHELRU register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHELRU</name>
              <bitRange>[24:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEHIT</name>
          <description>CHEHIT register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEHIT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHEMIS</name>
          <description>CHEMIS register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEMIS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED1</name>
          <description>RESERVED1 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CHEPFABT</name>
          <description>CHEPFABT register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHEPFABT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
