kiffie/pic32-pac/pic32mx2xx/pic32mx2x4fxxxd/PIC32MX274F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTB</name>
      <description>PORTB peripheral</description>
      <baseAddress>0xbf886100</baseAddress>
      <registers>
        <register>
          <name>ANSELB</name>
          <description>ANSELB register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>57359</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ANSB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELBCLR</name>
          <description>ANSELBCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ANSB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELBSET</name>
          <description>ANSELBSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ANSB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELBINV</name>
          <description>ANSELBINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANSB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ANSB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ANSB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ANSB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISB</name>
          <description>TRISB register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>58303</resetValue>
          <fields>
            <field>
              <name>TRISB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISBCLR</name>
          <description>TRISBCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISBSET</name>
          <description>TRISBSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISBINV</name>
          <description>TRISBINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <description>PORTB register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTBCLR</name>
          <description>PORTBCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTBSET</name>
          <description>PORTBSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTBINV</name>
          <description>PORTBINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATB</name>
          <description>LATB register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATBCLR</name>
          <description>LATBCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATBSET</name>
          <description>LATBSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
